app/views/comments/_form.html.erb

SELECT "purchases".* FROM "purchases"  ORDER BY "purchases"."file_url" ASC
---
     <%= f.label :purchase_name %><br>
     <%= f.collection_select :purchase_id, Purchase.order(:file_url), :id, :file_url %>