app/views/purchases/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
      <tr>
        <td><%= User.find(comment.user_id_id).email %></td>