app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
  def index
    if current_user.admin?
    @comments = Comment.all

INSERT INTO "comments" ("text", "user_id_id", "purchase_id_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", ""], ["user_id_id", 2], ["purchase_id_id", 1], ["created_at", "2015-12-07 10:03:28.418981"], ["updated_at", "2015-12-07 10:03:28.418981"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id_id = current_user[:id]
    @comment.purchase_id_id = $p_id
    respond_to do |format|
      if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
    def set_comment
      if @comment.user_id_id = current_user.id || current_user.admin?
      @comment = Comment.find(params[:id])