app/controllers/listofusers_controller.rb

SELECT "purchases".* FROM "purchases" WHERE (user_id =2)
---
  def purchasesofuser
    @purchases = Purchase.where("user_id =" + params[:id].to_s)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def banuser
    User.find(params[:id]).destroy

SELECT "users".* FROM "users"
---
  def statisticsuser
    @users = User.all