app/controllers/purchases_controller.rb

SELECT "purchases".* FROM "purchases"
---
  def index
    if current_user.admin?
      @purchases = Purchase.all

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."purchase_id" = $1  [["purchase_id", 1]]
---
  def show
    @purchase=Purchase.find(params[:id])
    @comment = Comment.new
    @comments = Comment.where(purchase_id: @purchase.id)

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = $1 LIMIT 1  [["id", 980190962]]
---
  def edit
    @purchase=Purchase.find(params[:id])

INSERT INTO "purchases" ("file_url", "comments", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["file_url", "Morpheus.pdf"], ["comments", "I need it for tomorrow morning please !"], ["user_id", 2], ["created_at", "2015-11-07 16:13:02.202759"], ["updated_at", "2015-11-07 16:13:02.202759"]]
---
  def create
    @purchase = Purchase.new(purchase_params)
    @purchase.status = 0
    @purchase.user_id = current_user.id
    respond_to do |format|
      if @purchase.save

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "purchases" SET "status" = $1, "updated_at" = $2 WHERE "purchases"."id" = $3  [["status", 1], ["updated_at", "2015-12-07 20:52:18.360731"], ["id", 1]]
---
  def update
    @purchase=Purchase.find(params[:id])
    respond_to do |format|
      if @purchase.update(purchase_params)

SELECT  "purchases".* FROM "purchases" WHERE "purchases"."id" = $1 LIMIT 1  [["id", 980190962]]
DELETE FROM "purchases" WHERE "purchases"."id" = $1  [["id", 980190962]]
---
  def destroy
    @purchase=Purchase.find(params[:id])
    @purchase.destroy